Revit 2027 API
InstanceBinding(CategorySet) Constructor
Constructs an instance binding with the set of categories passed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InstanceBinding(
	CategorySet categories
)
Public Sub New (
	categories As CategorySet
)
public:
InstanceBinding(
	CategorySet^ categories
)
new :
        categories : CategorySet -> InstanceBinding
Parameters
categories CategorySet
Remarks
Categories can be set or changed at a later time by using the Categories property of this object.
See Also
Reference
InstanceBinding Class
InstanceBinding Overload
Autodesk.Revit.DB Namespace